app/controllers/pages_controller.rb

  def profile
    # get the username from the URL as :id.
    if (User.find_by_username(params[:id]))
      @username = params[:id]

    else
    #Redirect to 404 (root for now)
      redirect_to root_path, :notice=> "User not found!"
  end

   @posts = Post.all.where("user_id = ?", User.find_by_username(params[:id]).id)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "john"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT "posts".* FROM "posts" WHERE (user_id = 4)  ORDER BY "posts"."created_at" DESC

  def explore
      @posts = Post.all
---
SELECT "posts".* FROM "posts"  ORDER BY "posts"."created_at" DESC