app/controllers/posts_controller.rb

    def create
        @post = Post.new(post_params)
        @post.user_id = current_user.id # assign the post to the user who created it.
        respond_to do |f|
            if (@post.save)
---
INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "Hello world!"], ["user_id", 5], ["created_at", "2016-01-17 23:55:33.209643"], ["updated_at", "2016-01-17 23:55:33.209643"]]